pschatzmann/arduino-audiokit/src/audio_board/esp32_s2_kaluga_1_v1_2/board_pins_config.c
/*
 * ESPRESSIF MIT License
 *
 * Copyright (c) 2020 <ESPRESSIF SYSTEMS (SHANGHAI) CO., LTD>
 *
 * Permission is hereby granted for use on all ESPRESSIF SYSTEMS products, in which case,
 * it is free of charge, to any person obtaining a copy of this software and associated
 * documentation files (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the Software is furnished
 * to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or
 * substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 */

#include "AudioKitSettings.h"
#if AUDIOKIT_BOARD==4

#include "audio_hal/audiokit_logger.h"
#include "audio_hal/audio_gpio.h"
#include <string.h>
#include "audio_hal/audiokit_board.h"
#include "audio_hal/audio_error.h"
#include "audio_hal/audio_mem.h"

#define TAG_KALUGA "KALUGA_V1_2"

esp_err_t get_i2c_pins(i2c_port_t port, i2c_config_t *i2c_config)
{
    AUDIO_NULL_CHECK(TAG_KALUGA, i2c_config, return ESP_FAIL);
    if (port == I2C_NUM_0) {
        i2c_config->sda_io_num = GPIO_NUM_8;
        i2c_config->scl_io_num = GPIO_NUM_7;
    } else {
        i2c_config->sda_io_num = -1;
        i2c_config->scl_io_num = -1;
        KIT_LOGE( "i2c port %d is not supported", port);
        return ESP_FAIL;
    }
    return ESP_OK;
}

esp_err_t get_i2s_pins(i2s_port_t port, i2s_pin_config_t *i2s_config)
{
    AUDIO_NULL_CHECK(TAG_KALUGA, i2s_config, return ESP_FAIL);

    i2s_config->bck_io_num = GPIO_NUM_18;
    i2s_config->ws_io_num = GPIO_NUM_17;
    i2s_config->data_out_num = GPIO_NUM_12;
    i2s_config->data_in_num = GPIO_NUM_46;
#if ESP_IDF_VERSION_MAJOR >= 4    
        i2s_config->mck_io_num = GPIO_NUM_0;
#endif

    return ESP_OK;
}

esp_err_t get_spi_pins(spi_bus_config_t *spi_config, spi_device_interface_config_t *spi_device_interface_config)
{
    AUDIO_NULL_CHECK(TAG_KALUGA, spi_config, return ESP_FAIL);
    AUDIO_NULL_CHECK(TAG_KALUGA, spi_device_interface_config, return ESP_FAIL);

    spi_config->mosi_io_num = -1;
    spi_config->miso_io_num = -1;
    spi_config->sclk_io_num = -1;
    spi_config->quadwp_io_num = -1;
    spi_config->quadhd_io_num = -1;

    spi_device_interface_config->spics_io_num = -1;

    KIT_LOGW("SPI interface is not supported");
    return ESP_OK;
}

esp_err_t i2s_mclk_gpio_select(i2s_port_t i2s_num, gpio_num_t gpio_num)
{
    if (i2s_num >= I2S_NUM_MAX) {
        KIT_LOGE( "Does not support i2s number(%d)", i2s_num);
        return ESP_ERR_INVALID_ARG;
    }
    gpio_num = (gpio_num_t)GPIO_NUM_35;
    KIT_LOGD( "I2S%d, MCLK output by GPIO%d", i2s_num, gpio_num);
    gpio_matrix_out(gpio_num, CLK_I2S_MUX_IDX, 0, 0);

    return ESP_OK;
}

int8_t get_headphone_detect_gpio(void)
{
    return -1;
}

// input-output pins
int8_t get_pa_enable_gpio(void)
{
    return PA_ENABLE_GPIO;
}

// adc button id
int8_t get_input_rec_id(void)
{
    return BUTTON_REC_ID;
}

int8_t get_input_mode_id(void)
{
    return BUTTON_MODE_ID;
}

int8_t get_input_set_id(void)
{
    return BUTTON_SET_ID;
}

int8_t get_input_play_id(void)
{
    return BUTTON_PLAY_ID;
}

int8_t get_input_volup_id(void)
{
    return BUTTON_VOLUP_ID;
}

int8_t get_input_voldown_id(void)
{
    return BUTTON_VOLDOWN_ID;
}

// led pins
int8_t get_ws2812_led_gpio(void)
{
    return WS2812_LED_GPIO;
}

int8_t get_es8311_mclk_src(void)
{
    return ES8311_MCLK_SOURCE;
}

#endif